app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT `tasks`.* FROM `tasks`

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO `tasks` (`task`, `discription`, `created_at`, `updated_at`) VALUES ('my task', 'hello task', '2015-01-05 20:08:57.648987', '2015-01-05 20:08:57.648987')

    def set_task
      @task = Task.find(params[:id])
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1